//
//  Category.swift
//  YeOzbroyenniaNS
//
//  Created by Oleksandr Smakhtin on 18.04.2023.
//

import Foundation


class Category {
    static let shared = Category()
    
    func getGunCategories() -> [String] {
        lazy var categories = [
            "Пістолети",
            "Пістолети-кулемети",
            "Автомати",
            "Рушниці",
            "Снайперські гвинтівки і карабіни",
            "Кулемети",
            "Гранатомети",
            "Протитанкові гранатомети",
            "Протитанкові ракетні комплекси",
            "Переносні системи ППО",
            "Аксесуари для стрілецької зброї",
            "Ручні гранати",
            "Міни"
        ]
        
        return categories
    }
    
    func getTeqCategories() -> [String] {
        lazy var categories = [
            "Стрілецька зброя",
            "Бронетехніка",
            "Артилерія",
            "Системи зв'язку",
            "Радіолокаційні станції",
            "Системи протиповітряної оборони",
            "Системи берегової оборони",
            "Інженерна техніка",
            "Автомобілі",
            "Авіаційна техніка",
            "Морське озброєння",  // -
            "Оптичні прилади",  // -
            "Системи захисту"  // -
        ]
        
        return categories
    }
}
